MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472JCTI/mcu.h
/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum {
    EVT_SRC_SWI_IRQ0             = 0U,
    EVT_SRC_SWI_IRQ1             = 1U,
    EVT_SRC_SWI_IRQ2             = 2U,
    EVT_SRC_SWI_IRQ3             = 3U,
    EVT_SRC_SWI_IRQ4             = 4U,
    EVT_SRC_SWI_IRQ5             = 5U,
    EVT_SRC_SWI_IRQ6             = 6U,
    EVT_SRC_SWI_IRQ7             = 7U,
    EVT_SRC_SWI_IRQ8             = 8U,
    EVT_SRC_SWI_IRQ9             = 9U,
    EVT_SRC_SWI_IRQ10            = 10U,
    EVT_SRC_SWI_IRQ11            = 11U,
    EVT_SRC_SWI_IRQ12            = 12U,
    EVT_SRC_SWI_IRQ13            = 13U,
    EVT_SRC_SWI_IRQ14            = 14U,
    EVT_SRC_SWI_IRQ15            = 15U,
    EVT_SRC_SWI_IRQ16            = 16U,
    EVT_SRC_SWI_IRQ17            = 17U,
    EVT_SRC_SWI_IRQ18            = 18U,
    EVT_SRC_SWI_IRQ19            = 19U,
    EVT_SRC_SWI_IRQ20            = 20U,
    EVT_SRC_SWI_IRQ21            = 21U,
    EVT_SRC_SWI_IRQ22            = 22U,
    EVT_SRC_SWI_IRQ23            = 23U,
    EVT_SRC_SWI_IRQ24            = 24U,
    EVT_SRC_SWI_IRQ25            = 25U,
    EVT_SRC_SWI_IRQ26            = 26U,
    EVT_SRC_SWI_IRQ27            = 27U,
    EVT_SRC_SWI_IRQ28            = 28U,
    EVT_SRC_SWI_IRQ29            = 29U,
    EVT_SRC_SWI_IRQ30            = 30U,
    EVT_SRC_SWI_IRQ31            = 31U,
    /*  External Interrupt   */
    EVT_SRC_PORT_EIRQ0           = 0U,      /* EIRQ0  */
    EVT_SRC_PORT_EIRQ1           = 1U,      /* EIRQ1  */
    EVT_SRC_PORT_EIRQ2           = 2U,      /* EIRQ2  */
    EVT_SRC_PORT_EIRQ3           = 3U,      /* EIRQ3  */
    EVT_SRC_PORT_EIRQ4           = 4U,      /* EIRQ4  */
    EVT_SRC_PORT_EIRQ5           = 5U,      /* EIRQ5  */
    EVT_SRC_PORT_EIRQ6           = 6U,      /* EIRQ6  */
    EVT_SRC_PORT_EIRQ7           = 7U,      /* EIRQ7  */
    EVT_SRC_PORT_EIRQ8           = 8U,      /* EIRQ8  */
    EVT_SRC_PORT_EIRQ9           = 9U,      /* EIRQ9  */
    EVT_SRC_PORT_EIRQ10          = 10U,     /* EIRQ10 */
    EVT_SRC_PORT_EIRQ11          = 11U,     /* EIRQ11 */
    EVT_SRC_PORT_EIRQ12          = 12U,     /* EIRQ12 */
    EVT_SRC_PORT_EIRQ13          = 13U,     /* EIRQ13 */
    EVT_SRC_PORT_EIRQ14          = 14U,     /* EIRQ14 */
    EVT_SRC_PORT_EIRQ15          = 15U,     /* EIRQ15 */
    /*  DMA_1  */
    EVT_SRC_DMA1_TC0             = 33U,     /* DMA_1_TC0  */
    EVT_SRC_DMA1_BTC0            = 34U,     /* DMA_1_BTC0 */
    EVT_SRC_DMA1_TC1             = 35U,     /* DMA_1_TC1  */
    EVT_SRC_DMA1_BTC1            = 36U,     /* DMA_1_BTC1 */
    EVT_SRC_DMA1_TC2             = 37U,     /* DMA_1_TC2  */
    EVT_SRC_DMA1_BTC2            = 38U,     /* DMA_1_BTC2 */
    EVT_SRC_DMA1_TC3             = 39U,     /* DMA_1_TC3  */
    EVT_SRC_DMA1_BTC3            = 40U,     /* DMA_1_BTC3 */
    EVT_SRC_DMA1_TC4             = 41U,     /* DMA_1_TC4  */
    EVT_SRC_DMA1_BTC4            = 42U,     /* DMA_1_BTC4 */
    EVT_SRC_DMA1_TC5             = 43U,     /* DMA_1_TC5  */
    EVT_SRC_DMA1_BTC5            = 44U,     /* DMA_1_BTC5 */
    EVT_SRC_DMA1_TC6             = 45U,     /* DMA_1_TC6  */
    EVT_SRC_DMA1_BTC6            = 46U,     /* DMA_1_BTC6 */
    EVT_SRC_DMA1_TC7             = 47U,     /* DMA_1_TC7  */
    EVT_SRC_DMA1_BTC7            = 48U,     /* DMA_1_BTC7 */
    /*  EFM  */
    EVT_SRC_EFM_OPTEND           = 51U,     /* EFM_OPTEND */
    /*  USBFS  */
    EVT_SRC_USBFS_SOF            = 52U,     /* USBFS_SOF */
    /*  DCU  */
    EVT_SRC_DCU1                 = 55U,     /* DCU1 */
    EVT_SRC_DCU2                 = 56U,     /* DCU2 */
    EVT_SRC_DCU3                 = 57U,     /* DCU3 */
    /*  DMA2  */
    EVT_SRC_DMA2_TC0             = 65U,     /* DMA_2_TC0  */
    EVT_SRC_DMA2_BTC0            = 66U,     /* DMA_2_BTC0 */
    EVT_SRC_DMA2_TC1             = 67U,     /* DMA_2_TC1  */
    EVT_SRC_DMA2_BTC1            = 68U,     /* DMA_2_BTC1 */
    EVT_SRC_DMA2_TC2             = 69U,     /* DMA_2_TC2  */
    EVT_SRC_DMA2_BTC2            = 70U,     /* DMA_2_BTC2 */
    EVT_SRC_DMA2_TC3             = 71U,     /* DMA_2_TC3  */
    EVT_SRC_DMA2_BTC3            = 72U,     /* DMA_2_BTC3 */
    EVT_SRC_DMA2_TC4             = 73U,     /* DMA_2_TC4  */
    EVT_SRC_DMA2_BTC4            = 74U,     /* DMA_2_BTC4 */
    EVT_SRC_DMA2_TC5             = 75U,     /* DMA_2_TC5  */
    EVT_SRC_DMA2_BTC5            = 76U,     /* DMA_2_BTC5 */
    EVT_SRC_DMA2_TC6             = 77U,     /* DMA_2_TC6  */
    EVT_SRC_DMA2_BTC6            = 78U,     /* DMA_2_BTC6 */
    EVT_SRC_DMA2_TC7             = 79U,     /* DMA_2_TC7  */
    EVT_SRC_DMA2_BTC7            = 80U,     /* DMA_2_BTC7 */
    /*  MAU  */
    EVT_SRC_MAU_SQRT             = 83U,     /* MAU_SQRT */
    /*  FMAC  */
    EVT_SRC_FMAC_1               = 91U,     /* FMAC_1_FIR */
    EVT_SRC_FMAC_2               = 92U,     /* FMAC_2_FIR */
    EVT_SRC_FMAC_3               = 93U,     /* FMAC_3_FIR */
    EVT_SRC_FMAC_4               = 94U,     /* FMAC_4_FIR */
    /*  TIMER0  */
    EVT_SRC_TMR0_1_CMP_A         = 96U,     /* TMR0_1_CMPA */
    EVT_SRC_TMR0_1_CMP_B         = 97U,     /* TMR0_1_CMPB */
    EVT_SRC_TMR0_2_CMP_A         = 98U,     /* TMR0_2_CMPA */
    EVT_SRC_TMR0_2_CMP_B         = 99U,     /* TMR0_2_CMPB */
    /*  TIMER2  */
    EVT_SRC_TMR2_1_CMP_A         = 100U,    /* TMR2_1_CMPA  */
    EVT_SRC_TMR2_1_CMP_B         = 101U,    /* TMR2_1_CMPB  */
    EVT_SRC_TMR2_1_OVF_A         = 102U,    /* TMR2_1_OVFA  */
    EVT_SRC_TMR2_1_OVF_B         = 103U,    /* TMR2_1_OVFB  */
    EVT_SRC_TMR2_2_CMP_A         = 104U,    /* TMR2_2_CMPA  */
    EVT_SRC_TMR2_2_CMP_B         = 105U,    /* TMR2_2_CMPB  */
    EVT_SRC_TMR2_2_OVF_A         = 106U,    /* TMR2_2_OVFA  */
    EVT_SRC_TMR2_2_OVF_B         = 107U,    /* TMR2_2_OVFB  */
    EVT_SRC_TMR2_3_CMP_A         = 108U,    /* TMR2_3_CMPA  */
    EVT_SRC_TMR2_3_CMP_B         = 109U,    /* TMR2_3_CMPB  */
    EVT_SRC_TMR2_3_OVF_A         = 110U,    /* TMR2_3_OVFA  */
    EVT_SRC_TMR2_3_OVF_B         = 111U,    /* TMR2_3_OVFB  */
    EVT_SRC_TMR2_4_CMP_A         = 112U,    /* TMR2_4_CMPA  */
    EVT_SRC_TMR2_4_CMP_B         = 113U,    /* TMR2_4_CMPB  */
    EVT_SRC_TMR2_4_OVF_A         = 114U,    /* TMR2_4_OVFA  */
    EVT_SRC_TMR2_4_OVF_B         = 115U,    /* TMR2_4_OVFB  */
    /*  RTC  */
    EVT_SRC_RTC_ALM              = 121U,     /* RTC_ALM */
    EVT_SRC_RTC_PRD              = 122U,     /* RTC_PRD */
    /*  TIMER6_1  */
    EVT_SRC_TMR6_1_GCMP_A        = 128U,     /* TMR6_1_GCMA */
    EVT_SRC_TMR6_1_GCMP_B        = 129U,     /* TMR6_1_GCMB */
    EVT_SRC_TMR6_1_GCMP_C        = 130U,     /* TMR6_1_GCMC */
    EVT_SRC_TMR6_1_GCMP_D        = 131U,     /* TMR6_1_GCMD */
    EVT_SRC_TMR6_1_GCMP_E        = 132U,     /* TMR6_1_GCME */
    EVT_SRC_TMR6_1_GCMP_F        = 133U,     /* TMR6_1_GCMF */
    EVT_SRC_TMR6_1_OVF           = 134U,     /* TMR6_1_GOVF */
    EVT_SRC_TMR6_1_UDF           = 135U,     /* TMR6_1_GUDF */
    EVT_SRC_TMR6_1_SCMP_A        = 137U,     /* TMR6_1_SCMA */
    EVT_SRC_TMR6_1_SCMP_B        = 138U,     /* TMR6_1_SCMB */
    /*  TIMERA_1  */
    EVT_SRC_TMRA_1_OVF           = 139U,     /* TMRA_1_OVF */
    EVT_SRC_TMRA_1_UDF           = 140U,     /* TMRA_1_UDF */
    EVT_SRC_TMRA_1_CMP           = 141U,     /* TMRA_1_CMP */
    /*  TIMER6_2  */
    EVT_SRC_TMR6_2_GCMP_A        = 144U,     /* TMR6_2_GCMA */
    EVT_SRC_TMR6_2_GCMP_B        = 145U,     /* TMR6_2_GCMB */
    EVT_SRC_TMR6_2_GCMP_C        = 146U,     /* TMR6_2_GCMC */
    EVT_SRC_TMR6_2_GCMP_D        = 147U,     /* TMR6_2_GCMD */
    EVT_SRC_TMR6_2_GCMP_E        = 148U,     /* TMR6_2_GCME */
    EVT_SRC_TMR6_2_GCMP_F        = 149U,     /* TMR6_2_GCMF */
    EVT_SRC_TMR6_2_OVF           = 150U,     /* TMR6_2_GOVF */
    EVT_SRC_TMR6_2_UDF           = 151U,     /* TMR6_2_GUDF */
    EVT_SRC_TMR6_2_SCMP_A        = 153U,     /* TMR6_2_SCMA */
    EVT_SRC_TMR6_2_SCMP_B        = 154U,     /* TMR6_2_SCMB */
    /*  TIMERA_2  */
    EVT_SRC_TMRA_2_OVF           = 155U,     /* TMRA_2_OVF */
    EVT_SRC_TMRA_2_UDF           = 156U,     /* TMRA_2_UDF */
    EVT_SRC_TMRA_2_CMP           = 157U,     /* TMRA_2_CMP */
    /*  TIMER6_3  */
    EVT_SRC_TMR6_3_GCMP_A        = 160U,     /* TMR6_3_GCMA */
    EVT_SRC_TMR6_3_GCMP_B        = 161U,     /* TMR6_3_GCMB */
    EVT_SRC_TMR6_3_GCMP_C        = 162U,     /* TMR6_3_GCMC */
    EVT_SRC_TMR6_3_GCMP_D        = 163U,     /* TMR6_3_GCMD */
    EVT_SRC_TMR6_3_GCMP_E        = 164U,     /* TMR6_3_GCME */
    EVT_SRC_TMR6_3_GCMP_F        = 165U,     /* TMR6_3_GCMF */
    EVT_SRC_TMR6_3_OVF           = 166U,     /* TMR6_3_GOVF */
    EVT_SRC_TMR6_3_UDF           = 167U,     /* TMR6_3_GUDF */
    EVT_SRC_TMR6_3_SCMP_A        = 169U,     /* TMR6_3_SCMA */
    EVT_SRC_TMR6_3_SCMP_B        = 170U,     /* TMR6_3_SCMB */
    /*  TIMERA_3  */
    EVT_SRC_TMRA_3_OVF           = 171U,     /* TMRA_3_OVF */
    EVT_SRC_TMRA_3_UDF           = 172U,     /* TMRA_3_UDF */
    EVT_SRC_TMRA_3_CMP           = 173U,     /* TMRA_3_CMP */
    /*  TIMER6_4 */
    EVT_SRC_TMR6_4_GCMP_A        = 176U,     /* TMR6_4_GCMA */
    EVT_SRC_TMR6_4_GCMP_B        = 177U,     /* TMR6_4_GCMB */
    EVT_SRC_TMR6_4_GCMP_C        = 178U,     /* TMR6_4_GCMC */
    EVT_SRC_TMR6_4_GCMP_D        = 179U,     /* TMR6_4_GCMD */
    EVT_SRC_TMR6_4_GCMP_E        = 180U,     /* TMR6_4_GCME */
    EVT_SRC_TMR6_4_GCMP_F        = 181U,     /* TMR6_4_GCMF */
    EVT_SRC_TMR6_4_OVF           = 182U,     /* TMR6_4_GOVF */
    EVT_SRC_TMR6_4_UDF           = 183U,     /* TMR6_4_GUDF */
    EVT_SRC_TMR6_4_SCMP_A        = 185U,     /* TMR6_4_SCMA */
    EVT_SRC_TMR6_4_SCMP_B        = 186U,     /* TMR6_4_SCMB */
    /*  TIMERA_4  */
    EVT_SRC_TMRA_4_OVF           = 187U,     /* TMRA_4_OVF */
    EVT_SRC_TMRA_4_UDF           = 188U,     /* TMRA_4_UDF */
    EVT_SRC_TMRA_4_CMP           = 189U,     /* TMRA_4_CMP */
    /*  TIMER6_5  */
    EVT_SRC_TMR6_5_GCMP_A        = 192U,     /* TMR6_5_GCMA */
    EVT_SRC_TMR6_5_GCMP_B        = 193U,     /* TMR6_5_GCMB */
    EVT_SRC_TMR6_5_GCMP_C        = 194U,     /* TMR6_5_GCMC */
    EVT_SRC_TMR6_5_GCMP_D        = 195U,     /* TMR6_5_GCMD */
    EVT_SRC_TMR6_5_GCMP_E        = 196U,     /* TMR6_5_GCME */
    EVT_SRC_TMR6_5_GCMP_F        = 197U,     /* TMR6_5_GCMF */
    EVT_SRC_TMR6_5_OVF           = 198U,     /* TMR6_5_GOVF */
    EVT_SRC_TMR6_5_UDF           = 199U,     /* TMR6_5_GUDF */
    EVT_SRC_TMR6_5_SCMP_A        = 201U,     /* TMR6_5_SCMA */
    EVT_SRC_TMR6_5_SCMP_B        = 202U,     /* TMR6_5_SCMB */
    /*  TIMER6_6  */
    EVT_SRC_TMR6_6_GCMP_A        = 208U,     /* TMR6_6_GCMA */
    EVT_SRC_TMR6_6_GCMP_B        = 209U,     /* TMR6_6_GCMB */
    EVT_SRC_TMR6_6_GCMP_C        = 210U,     /* TMR6_6_GCMC */
    EVT_SRC_TMR6_6_GCMP_D        = 211U,     /* TMR6_6_GCMD */
    EVT_SRC_TMR6_6_GCMP_E        = 212U,     /* TMR6_6_GCME */
    EVT_SRC_TMR6_6_GCMP_F        = 213U,     /* TMR6_6_GCMF */
    EVT_SRC_TMR6_6_OVF           = 214U,     /* TMR6_6_GOVF */
    EVT_SRC_TMR6_6_UDF           = 215U,     /* TMR6_6_GUDF */
    EVT_SRC_TMR6_6_SCMP_A        = 217U,     /* TMR6_6_SCMA */
    EVT_SRC_TMR6_6_SCMP_B        = 218U,     /* TMR6_6_SCMB */
    /*  TIMER6_7  */
    EVT_SRC_TMR6_7_GCMP_A        = 224U,     /* TMR6_7_GCMA */
    EVT_SRC_TMR6_7_GCMP_B        = 225U,     /* TMR6_7_GCMB */
    EVT_SRC_TMR6_7_GCMP_C        = 226U,     /* TMR6_7_GCMC */
    EVT_SRC_TMR6_7_GCMP_D        = 227U,     /* TMR6_7_GCMD */
    EVT_SRC_TMR6_7_GCMP_E        = 228U,     /* TMR6_7_GCME */
    EVT_SRC_TMR6_7_GCMP_F        = 229U,     /* TMR6_7_GCMF */
    EVT_SRC_TMR6_7_OVF           = 230U,     /* TMR6_7_GOVF */
    EVT_SRC_TMR6_7_UDF           = 231U,     /* TMR6_7_GUDF */
    EVT_SRC_TMR6_7_SCMP_A        = 233U,     /* TMR6_7_SCMA */
    EVT_SRC_TMR6_7_SCMP_B        = 234U,     /* TMR6_7_SCMB */
    /*  TIMER6_8  */
    EVT_SRC_TMR6_8_GCMP_A        = 240U,     /* TMR6_8_GCMA */
    EVT_SRC_TMR6_8_GCMP_B        = 241U,     /* TMR6_8_GCMB */
    EVT_SRC_TMR6_8_GCMP_C        = 242U,     /* TMR6_8_GCMC */
    EVT_SRC_TMR6_8_GCMP_D        = 243U,     /* TMR6_8_GCMD */
    EVT_SRC_TMR6_8_GCMP_E        = 244U,     /* TMR6_8_GCME */
    EVT_SRC_TMR6_8_GCMP_F        = 245U,     /* TMR6_8_GCMF */
    EVT_SRC_TMR6_8_OVF           = 246U,     /* TMR6_8_GOVF */
    EVT_SRC_TMR6_8_UDF           = 247U,     /* TMR6_8_GUDF */
    EVT_SRC_TMR6_8_SCMP_A        = 249U,     /* TMR6_8_SCMA */
    EVT_SRC_TMR6_8_SCMP_B        = 250U,     /* TMR6_8_SCMB */
    /*  TIMER6_9  */
    EVT_SRC_TMR6_9_GCMP_A        = 256U,     /* TMR6_9_GCMA */
    EVT_SRC_TMR6_9_GCMP_B        = 257U,     /* TMR6_9_GCMB */
    EVT_SRC_TMR6_9_GCMP_C        = 258U,     /* TMR6_9_GCMC */
    EVT_SRC_TMR6_9_GCMP_D        = 259U,     /* TMR6_9_GCMD */
    EVT_SRC_TMR6_9_GCMP_E        = 260U,     /* TMR6_9_GCME */
    EVT_SRC_TMR6_9_GCMP_F        = 261U,     /* TMR6_9_GCMF */
    EVT_SRC_TMR6_9_OVF           = 262U,     /* TMR6_9_GOVF */
    EVT_SRC_TMR6_9_UDF           = 263U,     /* TMR6_9_GUDF */
    EVT_SRC_TMR6_9_SCMP_A        = 265U,     /* TMR6_9_SCMA */
    EVT_SRC_TMR6_9_SCMP_B        = 266U,     /* TMR6_9_SCMB */
    /*  TIMER6_10  */
    EVT_SRC_TMR6_10_GCMP_A       = 272U,     /* TMR6_10_GCMA */
    EVT_SRC_TMR6_10_GCMP_B       = 273U,     /* TMR6_10_GCMB */
    EVT_SRC_TMR6_10_GCMP_C       = 274U,     /* TMR6_10_GCMC */
    EVT_SRC_TMR6_10_GCMP_D       = 275U,     /* TMR6_10_GCMD */
    EVT_SRC_TMR6_10_GCMP_E       = 276U,     /* TMR6_10_GCME */
    EVT_SRC_TMR6_10_GCMP_F       = 277U,     /* TMR6_10_GCMF */
    EVT_SRC_TMR6_10_OVF          = 278U,     /* TMR6_10_GOVF */
    EVT_SRC_TMR6_10_UDF          = 279U,     /* TMR6_10_GUDF */
    EVT_SRC_TMR6_10_SCMP_A       = 281U,     /* TMR6_10_SCMA */
    EVT_SRC_TMR6_10_SCMP_B       = 282U,     /* TMR6_10_SCMB */
    /*  TIMER4_1  */
    EVT_SRC_TMR4_1_GCMP_UH       = 288U,     /* TMR4_1_GCMUH */
    EVT_SRC_TMR4_1_GCMP_UL       = 289U,     /* TMR4_1_GCMUL */
    EVT_SRC_TMR4_1_GCMP_VH       = 290U,     /* TMR4_1_GCMVH */
    EVT_SRC_TMR4_1_GCMP_VL       = 291U,     /* TMR4_1_GCMVL */
    EVT_SRC_TMR4_1_GCMP_WH       = 292U,     /* TMR4_1_GCMWH */
    EVT_SRC_TMR4_1_GCMP_WL       = 293U,     /* TMR4_1_GCMWL */
    EVT_SRC_TMR4_1_OVF           = 294U,     /* TMR4_1_GOVF  */
    EVT_SRC_TMR4_1_UDF           = 295U,     /* TMR4_1_GUDF  */
    EVT_SRC_TMR4_1_SCMP0         = 299U,     /* TMR4_1_SCM0 */
    EVT_SRC_TMR4_1_SCMP1         = 300U,     /* TMR4_1_SCM1 */
    EVT_SRC_TMR4_1_SCMP2         = 301U,     /* TMR4_1_SCM2 */
    EVT_SRC_TMR4_1_SCMP3         = 302U,     /* TMR4_1_SCM3 */
    EVT_SRC_TMR4_1_SCMP4         = 303U,     /* TMR4_1_SCM4 */
    EVT_SRC_TMR4_1_SCMP5         = 304U,     /* TMR4_1_SCM5 */
    /*  CMP  */
    EVT_SRC_CMP1                 = 305U,     /* CMP_1_IRQ */
    EVT_SRC_CMP2                 = 306U,     /* CMP_2_IRQ */
    EVT_SRC_CMP3                 = 307U,     /* CMP_3_IRQ */
    EVT_SRC_CMP4                 = 308U,     /* CMP_4_IRQ */
    /*  USART1  */
    EVT_SRC_USART1_EI            = 320U,     /* USART_1_EI  */
    EVT_SRC_USART1_RI            = 321U,     /* USART_1_RI  */
    EVT_SRC_USART1_TI            = 322U,     /* USART_1_TI  */
    EVT_SRC_USART1_TCI           = 323U,     /* USART_1_TCI */
    EVT_SRC_USART1_RTO           = 324U,     /* USART_1_RTO */
    /*  USART2  */
    EVT_SRC_USART2_EI            = 325U,     /* USART_2_EI  */
    EVT_SRC_USART2_RI            = 326U,     /* USART_2_RI  */
    EVT_SRC_USART2_TI            = 327U,     /* USART_2_TI  */
    EVT_SRC_USART2_TCI           = 328U,     /* USART_2_TCI */
    EVT_SRC_USART2_RTO           = 329U,     /* USART_2_RTO */
    /*  SPI1  */
    EVT_SRC_SPI1_SPRI            = 330U,     /* SPI_1_SPRI */
    EVT_SRC_SPI1_SPTI            = 331U,     /* SPI_1_SPTI */
    EVT_SRC_SPI1_SPII            = 332U,     /* SPI_1_SPII */
    EVT_SRC_SPI1_SPEI            = 333U,     /* SPI_1_SPEI */
    EVT_SRC_SPI1_SPEND           = 334U,     /* SPI_1_SPEND */
    /*  SPI2  */
    EVT_SRC_SPI2_SPRI            = 335U,     /* SPI_2_SPRI */
    EVT_SRC_SPI2_SPTI            = 336U,     /* SPI_2_SPTI */
    EVT_SRC_SPI2_SPII            = 337U,     /* SPI_2_SPII */
    EVT_SRC_SPI2_SPEI            = 338U,     /* SPI_2_SPEI */
    EVT_SRC_SPI2_SPEND           = 339U,     /* SPI_2_SPEND */
    /*  TIMERA_5  */
    EVT_SRC_TMRA_5_OVF           = 340U,     /* TMRA_5_OVF */
    EVT_SRC_TMRA_5_UDF           = 341U,     /* TMRA_5_UDF */
    EVT_SRC_TMRA_5_CMP           = 342U,     /* TMRA_5_CMP */
    /*  TIMERA_6  */
    EVT_SRC_TMRA_6_OVF           = 343U,     /* TMRA_6_OVF */
    EVT_SRC_TMRA_6_UDF           = 344U,     /* TMRA_6_UDF */
    EVT_SRC_TMRA_6_CMP           = 345U,     /* TMRA_6_CMP */
    /*  EVENT PORT  */
    EVT_SRC_EVENT_PORT1          = 348U,     /* EVENT_PORT1 */
    EVT_SRC_EVENT_PORT2          = 349U,     /* EVENT_PORT2 */
    EVT_SRC_EVENT_PORT3          = 350U,     /* EVENT_PORT3 */
    EVT_SRC_EVENT_PORT4          = 351U,     /* EVENT_PORT4 */
    /*  USART3  */
    EVT_SRC_USART3_BRKWKPI       = 352U,     /* USART_3_BRKWKPI */
    EVT_SRC_USART3_EI            = 353U,     /* USART_3_EI      */
    EVT_SRC_USART3_RI            = 354U,     /* USART_3_RI      */
    EVT_SRC_USART3_TI            = 355U,     /* USART_3_TI      */
    EVT_SRC_USART3_TCI           = 356U,     /* USART_3_TCI     */
    /*  USART4  */
    EVT_SRC_USART4_EI            = 357U,     /* USART_4_EI  */
    EVT_SRC_USART4_RI            = 358U,     /* USART_4_RI  */
    EVT_SRC_USART4_TI            = 359U,     /* USART_4_TI  */
    EVT_SRC_USART4_TCI           = 360U,     /* USART_4_TCI */
    EVT_SRC_USART4_RTO           = 361U,     /* USART_4_RTO */
    /*  SPI3  */
    EVT_SRC_SPI3_SPRI            = 362U,     /* SPI_3_SPRI */
    EVT_SRC_SPI3_SPTI            = 363U,     /* SPI_3_SPTI */
    EVT_SRC_SPI3_SPII            = 364U,     /* SPI_3_SPII */
    EVT_SRC_SPI3_SPEI            = 365U,     /* SPI_3_SPEI */
    EVT_SRC_SPI3_SPEND           = 366U,     /* SPI_3_SPEND */
    /*  SPI4  */
    EVT_SRC_SPI4_SPRI            = 367U,     /* SPI_4_SPRI */
    EVT_SRC_SPI4_SPTI            = 368U,     /* SPI_4_SPTI */
    EVT_SRC_SPI4_SPII            = 369U,     /* SPI_4_SPII */
    EVT_SRC_SPI4_SPEI            = 370U,     /* SPI_4_SPEI */
    EVT_SRC_SPI4_SPEND           = 371U,     /* SPI_4_SPEND */
    /*  HASH  */
    EVT_SRC_HASH                 = 379U,     /* HASH_INT */
    /*  USART5  */
    EVT_SRC_USART5_EI            = 384U,     /* USART_5_EI  */
    EVT_SRC_USART5_RI            = 385U,     /* USART_5_RI  */
    EVT_SRC_USART5_TI            = 386U,     /* USART_5_TI  */
    EVT_SRC_USART5_TCI           = 387U,     /* USART_5_TCI */
    EVT_SRC_USART5_RTO           = 388U,     /* USART_5_RTO */
    /*  USART6  */
    EVT_SRC_USART6_BRKWKPI       = 389U,     /* USART_6_BRKWKPI */
    EVT_SRC_USART6_EI            = 390U,     /* USART_6_EI      */
    EVT_SRC_USART6_RI            = 391U,     /* USART_6_RI      */
    EVT_SRC_USART6_TI            = 392U,     /* USART_6_TI      */
    EVT_SRC_USART6_TCI           = 393U,     /* USART_6_TCI     */
    /*  MDIO  */
    EVT_SRC_MDIO_AOS             = 413U,     /* MDIO_AOS */
    /*  AOS  */
    EVT_SRC_AOS_STRG             = 415U,     /* AOS_STRG */
    /*  PLA  */
    EVT_SRC_PLA_ADTRG0           = 432U,     /* PLA_ADTRG0  */
    EVT_SRC_PLA_ADTRG1           = 433U,     /* PLA_ADTRG1  */
    EVT_SRC_PLA_ADTRG2           = 434U,     /* PLA_ADTRG2  */
    EVT_SRC_PLA_ADTRG3           = 435U,     /* PLA_ADTRG3  */
    EVT_SRC_PLA_ADTRG4           = 436U,     /* PLA_ADTRG4  */
    EVT_SRC_PLA_ADTRG5           = 437U,     /* PLA_ADTRG5  */
    EVT_SRC_PLA_ADTRG6           = 438U,     /* PLA_ADTRG6  */
    EVT_SRC_PLA_ADTRG7           = 439U,     /* PLA_ADTRG7  */
    EVT_SRC_PLA_ADTRG8           = 440U,     /* PLA_ADTRG8  */
    EVT_SRC_PLA_ADTRG9           = 441U,     /* PLA_ADTRG9  */
    EVT_SRC_PLA_ADTRG10          = 442U,     /* PLA_ADTRG10 */
    EVT_SRC_PLA_ADTRG11          = 443U,     /* PLA_ADTRG11 */
    EVT_SRC_PLA_ADTRG12          = 444U,     /* PLA_ADTRG12 */
    EVT_SRC_PLA_ADTRG13          = 445U,     /* PLA_ADTRG13 */
    EVT_SRC_PLA_ADTRG14          = 446U,     /* PLA_ADTRG14 */
    EVT_SRC_PLA_ADTRG15          = 447U,     /* PLA_ADTRG15 */
    /*  I2C1  */
    EVT_SRC_I2C1_RXI             = 448U,     /* I2C_1_RXI */
    EVT_SRC_I2C1_TXI             = 449U,     /* I2C_1_TXI */
    EVT_SRC_I2C1_TEI             = 450U,     /* I2C_1_TEI */
    EVT_SRC_I2C1_EEI             = 451U,     /* I2C_1_EEI */
    /*  I2C2  */
    EVT_SRC_I2C2_RXI             = 452U,     /* I2C_2_RXI */
    EVT_SRC_I2C2_TXI             = 453U,     /* I2C_2_TXI */
    EVT_SRC_I2C2_TEI             = 454U,     /* I2C_2_TEI */
    EVT_SRC_I2C2_EEI             = 455U,     /* I2C_2_EEI */
    /*  I2C3  */
    EVT_SRC_I2C3_RXI             = 456U,     /* I2C_3_RXI */
    EVT_SRC_I2C3_TXI             = 457U,     /* I2C_3_TXI */
    EVT_SRC_I2C3_TEI             = 458U,     /* I2C_3_TEI */
    EVT_SRC_I2C3_EEI             = 459U,     /* I2C_3_EEI */
    /*  LVD  */
    EVT_SRC_LVD1                = 465U,     /* LVD1 */
    EVT_SRC_LVD2                = 466U,     /* LVD2 */
    /*  OTS  */
    EVT_SRC_OTS                  = 467U,     /* OTS */
    /*  WDT  */
    EVT_SRC_WDT_REFUDF           = 471U,     /* WDT_REFUDF */
    /*  ADC1  */
    EVT_SRC_ADC1_EOCA            = 480U,     /* ADC_1_EOCA */
    EVT_SRC_ADC1_EOCB            = 481U,     /* ADC_1_EOCB */
    EVT_SRC_ADC1_CMP0            = 482U,     /* ADC_1_CMP0 */
    EVT_SRC_ADC1_CMP1            = 483U,     /* ADC_1_CMP1 */
    /*  ADC2  */
    EVT_SRC_ADC2_EOCA            = 484U,     /* ADC_2_EOCA */
    EVT_SRC_ADC2_EOCB            = 485U,     /* ADC_2_EOCB */
    EVT_SRC_ADC2_CMP0            = 486U,     /* ADC_2_CMP0 */
    EVT_SRC_ADC2_CMP1            = 487U,     /* ADC_2_CMP1 */
    /*  ADC3  */
    EVT_SRC_ADC3_EOCA            = 488U,     /* ADC_3_EOCA */
    EVT_SRC_ADC3_EOCB            = 489U,     /* ADC_3_EOCB */
    EVT_SRC_ADC3_CMP0            = 490U,     /* ADC_3_CMP0 */
    EVT_SRC_ADC3_CMP1            = 491U,     /* ADC_3_CMP1 */
    /*  TRNG  */
    EVT_SRC_TRNG_END             = 492U,     /* TRNG_END */
    EVT_SRC_MAX                  = 511U,
} en_event_src_t;

