MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472JCTI/mcu.h
/*  Bit definition for GPIO_POSRC register  */
#define GPIO_POSRC_POS13_POS                           (13U)
#define GPIO_POSRC_POS13                               (0x2000U)
#define GPIO_POSRC_POS14_POS                           (14U)
#define GPIO_POSRC_POS14                               (0x4000U)
#define GPIO_POSRC_POS15_POS                           (15U)
#define GPIO_POSRC_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRC register  */
#define GPIO_PORRC_POR13_POS                           (13U)
#define GPIO_PORRC_POR13                               (0x2000U)
#define GPIO_PORRC_POR14_POS                           (14U)
#define GPIO_PORRC_POR14                               (0x4000U)
#define GPIO_PORRC_POR15_POS                           (15U)
#define GPIO_PORRC_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRC register  */
#define GPIO_POTRC_POT13_POS                           (13U)
#define GPIO_POTRC_POT13                               (0x2000U)
#define GPIO_POTRC_POT14_POS                           (14U)
#define GPIO_POTRC_POT14                               (0x4000U)
#define GPIO_POTRC_POT15_POS                           (15U)
#define GPIO_POTRC_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRF register  */
#define GPIO_PIDRF_PIN00_POS                           (0U)
#define GPIO_PIDRF_PIN00                               (0x0001U)
#define GPIO_PIDRF_PIN01_POS                           (1U)
#define GPIO_PIDRF_PIN01                               (0x0002U)
#define GPIO_PIDRF_PIN02_POS                           (2U)
#define GPIO_PIDRF_PIN02                               (0x0004U)
#define GPIO_PIDRF_PIN03_POS                           (3U)
#define GPIO_PIDRF_PIN03                               (0x0008U)

/*  Bit definition for GPIO_PODRF register  */
#define GPIO_PODRF_POUT00_POS                          (0U)
#define GPIO_PODRF_POUT00                              (0x0001U)
#define GPIO_PODRF_POUT01_POS                          (1U)
#define GPIO_PODRF_POUT01                              (0x0002U)
#define GPIO_PODRF_POUT02_POS                          (2U)
#define GPIO_PODRF_POUT02                              (0x0004U)
#define GPIO_PODRF_POUT03_POS                          (3U)
#define GPIO_PODRF_POUT03                              (0x0008U)

/*  Bit definition for GPIO_POERF register  */
#define GPIO_POERF_POUTE00_POS                         (0U)
#define GPIO_POERF_POUTE00                             (0x0001U)
#define GPIO_POERF_POUTE01_POS                         (1U)
#define GPIO_POERF_POUTE01                             (0x0002U)
#define GPIO_POERF_POUTE02_POS                         (2U)
#define GPIO_POERF_POUTE02                             (0x0004U)
#define GPIO_POERF_POUTE03_POS                         (3U)
#define GPIO_POERF_POUTE03                             (0x0008U)

/*  Bit definition for GPIO_POSRF register  */
#define GPIO_POSRF_POS00_POS                           (0U)
#define GPIO_POSRF_POS00                               (0x0001U)
#define GPIO_POSRF_POS01_POS                           (1U)
#define GPIO_POSRF_POS01                               (0x0002U)
#define GPIO_POSRF_POS02_POS                           (2U)
#define GPIO_POSRF_POS02                               (0x0004U)
#define GPIO_POSRF_POS03_POS                           (3U)
#define GPIO_POSRF_POS03                               (0x0008U)

/*  Bit definition for GPIO_PORRF register  */
#define GPIO_PORRF_POR00_POS                           (0U)
#define GPIO_PORRF_POR00                               (0x0001U)
#define GPIO_PORRF_POR01_POS                           (1U)
#define GPIO_PORRF_POR01                               (0x0002U)
#define GPIO_PORRF_POR02_POS                           (2U)
#define GPIO_PORRF_POR02                               (0x0004U)
#define GPIO_PORRF_POR03_POS                           (3U)
#define GPIO_PORRF_POR03                               (0x0008U)

/*  Bit definition for GPIO_POTRF register  */
#define GPIO_POTRF_POT00_POS                           (0U)
#define GPIO_POTRF_POT00                               (0x0001U)
#define GPIO_POTRF_POT01_POS                           (1U)
#define GPIO_POTRF_POT01                               (0x0002U)
#define GPIO_POTRF_POT02_POS                           (2U)
#define GPIO_POTRF_POT02                               (0x0004U)
#define GPIO_POTRF_POT03_POS                           (3U)
#define GPIO_POTRF_POT03                               (0x0008U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x001FU)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)
#define GPIO_PSPCR_SPFE_2                              (0x0004U)
#define GPIO_PSPCR_SPFE_3                              (0x0008U)
#define GPIO_PSPCR_SPFE_4                              (0x0010U)

/*  Bit definition for GPIO_PCCR register  */
#define GPIO_PCCR_BFSEL_POS                            (0U)
#define GPIO_PCCR_BFSEL                                (0x003FU)
#define GPIO_PCCR_RDWT_POS                             (12U)
#define GPIO_PCCR_RDWT                                 (0x7000U)

/*  Bit definition for GPIO_PWPR register  */
#define GPIO_PWPR_WE_POS                               (0U)
#define GPIO_PWPR_WE                                   (0x0001U)
#define GPIO_PWPR_WP_POS                               (8U)
#define GPIO_PWPR_WP                                   (0xFF00U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  (0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 (0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   (0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   (0x0030U)
#define GPIO_PCR_DRV_0                                 (0x0010U)
#define GPIO_PCR_DRV_1                                 (0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   (0x0040U)
#define GPIO_PCR_PUD_POS                               (7U)
#define GPIO_PCR_PUD                                   (0x0080U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   (0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  (0x0200U)
#define GPIO_PCR_CINSEL_POS                            (10U)
#define GPIO_PCR_CINSEL                                (0x0400U)
#define GPIO_PCR_INTE_POS                              (12U)
#define GPIO_PCR_INTE                                  (0x1000U)
#define GPIO_PCR_PINAE_POS                             (13U)
#define GPIO_PCR_PINAE                                 (0x2000U)
#define GPIO_PCR_LTE_POS                               (14U)
#define GPIO_PCR_LTE                                   (0x4000U)
#define GPIO_PCR_DDIS_POS                              (15U)
#define GPIO_PCR_DDIS                                  (0x8000U)

/*  Bit definition for GPIO_PFSR register  */
#define GPIO_PFSR_FSEL_POS                             (0U)
#define GPIO_PFSR_FSEL                                 (0x003FU)
#define GPIO_PFSR_BFE_POS                              (8U)
#define GPIO_PFSR_BFE                                  (0x0100U)

