MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472JCTI/mcu.h
typedef struct {
    stc_hash_cr_bit_t                        CR_b;
} bCM_HASH_TypeDef;

typedef struct {
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    stc_i2c_cr3_bit_t                        CR3_b;
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED1[64];
    stc_i2c_ccr_bit_t                        CCR_b;
    stc_i2c_fltr_bit_t                       FLTR_b;
    stc_i2c_fstr_bit_t                       FSTR_b;
} bCM_I2C_TypeDef;

typedef struct {
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bCM_ICG_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_intc_nmier_bit_t                     NMIER_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmifcr_bit_t                    NMIFCR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    stc_intc_eirqcr_bit_t                    EIRQCR10_b;
    stc_intc_eirqcr_bit_t                    EIRQCR11_b;
    stc_intc_eirqcr_bit_t                    EIRQCR12_b;
    stc_intc_eirqcr_bit_t                    EIRQCR13_b;
    stc_intc_eirqcr_bit_t                    EIRQCR14_b;
    stc_intc_eirqcr_bit_t                    EIRQCR15_b;
    stc_intc_wken_bit_t                      WKEN_b;
    stc_intc_eifr_bit_t                      EIFR_b;
    stc_intc_eifcr_bit_t                     EIFCR_b;
    uint32_t                                 RESERVED1[4608];
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
} bCM_INTC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_keyscan_ser_bit_t                    SER_b;
} bCM_KEYSCAN_TypeDef;

typedef struct {
    stc_mau_csr_bit_t                        CSR_b;
} bCM_MAU_TypeDef;

typedef struct {
    stc_mdio_mdcon_bit_t                     MDCON_b;
    stc_mdio_mdcon1_bit_t                    MDCON1_b;
    uint32_t                                 RESERVED0[160];
    stc_mdio_mdsta_bit_t                     MDSTA_b;
    stc_mdio_mdien_bit_t                     MDIEN_b;
    uint32_t                                 RESERVED1[32];
    stc_mdio_mdto_bit_t                      MDTO_b;
} bCM_MDIO_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[512];
    stc_mpu_sr_bit_t                         SR_b;
    stc_mpu_eclr_bit_t                       ECLR_b;
    stc_mpu_wp_bit_t                         WP_b;
    stc_mpu_ippr_bit_t                       IPPR_b;
    uint32_t                                 RESERVED1[32];
    stc_mpu_msppctl_bit_t                    MSPPCTL_b;
    uint32_t                                 RESERVED2[32];
    stc_mpu_psppctl_bit_t                    PSPPCTL_b;
    stc_mpu_srge_bit_t                       S1RGE_b;
    stc_mpu_srgwp_bit_t                      S1RGWP_b;
    stc_mpu_srgrp_bit_t                      S1RGRP_b;
    stc_mpu_scr_bit_t                        S1CR_b;
    stc_mpu_srge_bit_t                       S2RGE_b;
    stc_mpu_srgwp_bit_t                      S2RGWP_b;
    stc_mpu_srgrp_bit_t                      S2RGRP_b;
    stc_mpu_scr_bit_t                        S2CR_b;
    stc_mpu_frge_bit_t                       FRGE_b;
    stc_mpu_frgwp_bit_t                      FRGWP_b;
    stc_mpu_frgrp_bit_t                      FRGRP_b;
    stc_mpu_fcr_bit_t                        FCR_b;
} bCM_MPU_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1904640];
    stc_ots_ctl_bit_t                        CTL_b;
} bCM_OTS_TypeDef;

typedef struct {
    stc_peric_usb_syctlreg_bit_t             USB_SYCTLREG_b;
    uint32_t                                 RESERVED0[64];
    stc_peric_smc_enar_bit_t                 SMC_ENAR_b;
    uint32_t                                 RESERVED1[64];
    stc_peric_can_syctlreg_bit_t             CAN_SYCTLREG_b;
    stc_peric_usart1_nfc_bit_t               USART1_NFC_b;
} bCM_PERIC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[128];
    stc_pla_muxs_bit_t                       MUXS0_b;
    uint32_t                                 RESERVED1[32];
    stc_pla_ctl_bit_t                        CTL0_b;
    stc_pla_muxs_bit_t                       MUXS1_b;
    uint32_t                                 RESERVED2[32];
    stc_pla_ctl_bit_t                        CTL1_b;
    stc_pla_muxs_bit_t                       MUXS2_b;
    uint32_t                                 RESERVED3[32];
    stc_pla_ctl_bit_t                        CTL2_b;
    stc_pla_muxs_bit_t                       MUXS3_b;
    uint32_t                                 RESERVED4[32];
    stc_pla_ctl_bit_t                        CTL3_b;
    stc_pla_muxs_bit_t                       MUXS4_b;
    uint32_t                                 RESERVED5[32];
    stc_pla_ctl_bit_t                        CTL4_b;
    stc_pla_muxs_bit_t                       MUXS5_b;
    uint32_t                                 RESERVED6[32];
    stc_pla_ctl_bit_t                        CTL5_b;
    stc_pla_muxs_bit_t                       MUXS6_b;
    uint32_t                                 RESERVED7[32];
    stc_pla_ctl_bit_t                        CTL6_b;
    stc_pla_muxs_bit_t                       MUXS7_b;
    uint32_t                                 RESERVED8[32];
    stc_pla_ctl_bit_t                        CTL7_b;
    stc_pla_muxs_bit_t                       MUXS8_b;
    uint32_t                                 RESERVED9[32];
    stc_pla_ctl_bit_t                        CTL8_b;
    stc_pla_muxs_bit_t                       MUXS9_b;
    uint32_t                                 RESERVED10[32];
    stc_pla_ctl_bit_t                        CTL9_b;
    stc_pla_muxs_bit_t                       MUXS10_b;
    uint32_t                                 RESERVED11[32];
    stc_pla_ctl_bit_t                        CTL10_b;
    stc_pla_muxs_bit_t                       MUXS11_b;
    uint32_t                                 RESERVED12[32];
    stc_pla_ctl_bit_t                        CTL11_b;
    stc_pla_muxs_bit_t                       MUXS12_b;
    uint32_t                                 RESERVED13[32];
    stc_pla_ctl_bit_t                        CTL12_b;
    stc_pla_muxs_bit_t                       MUXS13_b;
    uint32_t                                 RESERVED14[32];
    stc_pla_ctl_bit_t                        CTL13_b;
    stc_pla_muxs_bit_t                       MUXS14_b;
    uint32_t                                 RESERVED15[32];
    stc_pla_ctl_bit_t                        CTL14_b;
    stc_pla_muxs_bit_t                       MUXS15_b;
    uint32_t                                 RESERVED16[32];
    stc_pla_ctl_bit_t                        CTL15_b;
} bCM_PLA_TypeDef;

