MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F472JCTI/mcu.h
typedef struct {
    uint32_t                                 RESERVED0[2560];
    stc_tmr6_gconr_bit_t                     GCONR_b;
    stc_tmr6_iconr_bit_t                     ICONR_b;
    stc_tmr6_bconr_bit_t                     BCONR_b;
    stc_tmr6_dconr_bit_t                     DCONR_b;
    uint32_t                                 RESERVED1[32];
    stc_tmr6_pcnar_bit_t                     PCNAR_b;
    stc_tmr6_pcnbr_bit_t                     PCNBR_b;
    stc_tmr6_fcngr_bit_t                     FCNGR_b;
    stc_tmr6_vperr_bit_t                     VPERR_b;
    stc_tmr6_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED2[192];
    stc_tmr6_hstar_bit_t                     HSTAR_b;
    stc_tmr6_hstpr_bit_t                     HSTPR_b;
    stc_tmr6_hclrr_bit_t                     HCLRR_b;
    stc_tmr6_hupdr_bit_t                     HUPDR_b;
    stc_tmr6_hcpar_bit_t                     HCPAR_b;
    stc_tmr6_hcpbr_bit_t                     HCPBR_b;
    stc_tmr6_hcupr_bit_t                     HCUPR_b;
    stc_tmr6_hcdor_bit_t                     HCDOR_b;
} bCM_TMR6_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1888];
    stc_tmr6_common_fcntr_bit_t              FCNTR_b;
    stc_tmr6_common_sstar_bit_t              SSTAR_b;
    stc_tmr6_common_sstpr_bit_t              SSTPR_b;
    stc_tmr6_common_sclrr_bit_t              SCLRR_b;
    stc_tmr6_common_supdr_bit_t              SUPDR_b;
} bCM_TMR6_COMMON_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[1024];
    stc_tmra_bcstrl_bit_t                    BCSTRL_b;
    stc_tmra_bcstrh_bit_t                    BCSTRH_b;
    uint32_t                                 RESERVED1[16];
    stc_tmra_hconr_bit_t                     HCONR_b;
    uint32_t                                 RESERVED2[16];
    stc_tmra_hcupr_bit_t                     HCUPR_b;
    uint32_t                                 RESERVED3[16];
    stc_tmra_hcdor_bit_t                     HCDOR_b;
    uint32_t                                 RESERVED4[16];
    stc_tmra_iconr_bit_t                     ICONR_b;
    uint32_t                                 RESERVED5[16];
    stc_tmra_econr_bit_t                     ECONR_b;
    uint32_t                                 RESERVED6[16];
    stc_tmra_fconr_bit_t                     FCONR_b;
    uint32_t                                 RESERVED7[16];
    stc_tmra_stflr_bit_t                     STFLR_b;
    uint32_t                                 RESERVED8[272];
    stc_tmra_bconr_bit_t                     BCONR1_b;
    uint32_t                                 RESERVED9[48];
    stc_tmra_bconr_bit_t                     BCONR2_b;
    uint32_t                                 RESERVED10[432];
    stc_tmra_cconr_bit_t                     CCONR1_b;
    uint32_t                                 RESERVED11[16];
    stc_tmra_cconr_bit_t                     CCONR2_b;
    uint32_t                                 RESERVED12[16];
    stc_tmra_cconr_bit_t                     CCONR3_b;
    uint32_t                                 RESERVED13[16];
    stc_tmra_cconr_bit_t                     CCONR4_b;
    uint32_t                                 RESERVED14[400];
    stc_tmra_pconr_bit_t                     PCONR1_b;
    uint32_t                                 RESERVED15[16];
    stc_tmra_pconr_bit_t                     PCONR2_b;
    uint32_t                                 RESERVED16[16];
    stc_tmra_pconr_bit_t                     PCONR3_b;
    uint32_t                                 RESERVED17[16];
    stc_tmra_pconr_bit_t                     PCONR4_b;
} bCM_TMRA_TypeDef;

typedef struct {
    stc_trng_cr_bit_t                        CR_b;
    stc_trng_mr_bit_t                        MR_b;
} bCM_TRNG_TypeDef;

typedef struct {
    stc_usart_sr_bit_t                       SR_b;
    stc_usart_tdr_bit_t                      TDR_b;
    uint32_t                                 RESERVED0[48];
    stc_usart_cr1_bit_t                      CR1_b;
    stc_usart_cr2_bit_t                      CR2_b;
    stc_usart_cr3_bit_t                      CR3_b;
} bCM_USART_TypeDef;

typedef struct {
    stc_usbfs_gvbuscfg_bit_t                 GVBUSCFG_b;
    uint32_t                                 RESERVED0[32];
    stc_usbfs_gahbcfg_bit_t                  GAHBCFG_b;
    stc_usbfs_gusbcfg_bit_t                  GUSBCFG_b;
    stc_usbfs_grstctl_bit_t                  GRSTCTL_b;
    stc_usbfs_gintsts_bit_t                  GINTSTS_b;
    stc_usbfs_gintmsk_bit_t                  GINTMSK_b;
    uint32_t                                 RESERVED1[448];
    stc_usbfs_glpmcfg_bit_t                  GLPMCFG_b;
    uint32_t                                 RESERVED2[7488];
    stc_usbfs_hcfg_bit_t                     HCFG_b;
    uint32_t                                 RESERVED3[480];
    stc_usbfs_hprt_bit_t                     HPRT_b;
    uint32_t                                 RESERVED4[1504];
    stc_usbfs_hcchar_bit_t                   HCCHAR0_b;
    uint32_t                                 RESERVED5[32];
    stc_usbfs_hcint_bit_t                    HCINT0_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK0_b;
    uint32_t                                 RESERVED6[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR1_b;
    uint32_t                                 RESERVED7[32];
    stc_usbfs_hcint_bit_t                    HCINT1_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK1_b;
    uint32_t                                 RESERVED8[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR2_b;
    uint32_t                                 RESERVED9[32];
    stc_usbfs_hcint_bit_t                    HCINT2_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK2_b;
    uint32_t                                 RESERVED10[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR3_b;
    uint32_t                                 RESERVED11[32];
    stc_usbfs_hcint_bit_t                    HCINT3_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK3_b;
    uint32_t                                 RESERVED12[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR4_b;
    uint32_t                                 RESERVED13[32];
    stc_usbfs_hcint_bit_t                    HCINT4_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK4_b;
    uint32_t                                 RESERVED14[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR5_b;
    uint32_t                                 RESERVED15[32];
    stc_usbfs_hcint_bit_t                    HCINT5_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK5_b;
    uint32_t                                 RESERVED16[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR6_b;
    uint32_t                                 RESERVED17[32];
    stc_usbfs_hcint_bit_t                    HCINT6_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK6_b;
    uint32_t                                 RESERVED18[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR7_b;
    uint32_t                                 RESERVED19[32];
    stc_usbfs_hcint_bit_t                    HCINT7_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK7_b;
    uint32_t                                 RESERVED20[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR8_b;
    uint32_t                                 RESERVED21[32];
    stc_usbfs_hcint_bit_t                    HCINT8_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK8_b;
    uint32_t                                 RESERVED22[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR9_b;
    uint32_t                                 RESERVED23[32];
    stc_usbfs_hcint_bit_t                    HCINT9_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK9_b;
    uint32_t                                 RESERVED24[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR10_b;
    uint32_t                                 RESERVED25[32];
    stc_usbfs_hcint_bit_t                    HCINT10_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK10_b;
    uint32_t                                 RESERVED26[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR11_b;
    uint32_t                                 RESERVED27[32];
    stc_usbfs_hcint_bit_t                    HCINT11_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK11_b;
    uint32_t                                 RESERVED28[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR12_b;
    uint32_t                                 RESERVED29[32];
    stc_usbfs_hcint_bit_t                    HCINT12_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK12_b;
    uint32_t                                 RESERVED30[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR13_b;
    uint32_t                                 RESERVED31[32];
    stc_usbfs_hcint_bit_t                    HCINT13_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK13_b;
    uint32_t                                 RESERVED32[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR14_b;
    uint32_t                                 RESERVED33[32];
    stc_usbfs_hcint_bit_t                    HCINT14_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK14_b;
    uint32_t                                 RESERVED34[128];
    stc_usbfs_hcchar_bit_t                   HCCHAR15_b;
    uint32_t                                 RESERVED35[32];
    stc_usbfs_hcint_bit_t                    HCINT15_b;
    stc_usbfs_hcintmsk_bit_t                 HCINTMSK15_b;
    uint32_t                                 RESERVED36[2176];
    stc_usbfs_dcfg_bit_t                     DCFG_b;
    stc_usbfs_dctl_bit_t                     DCTL_b;
    stc_usbfs_dsts_bit_t                     DSTS_b;
    uint32_t                                 RESERVED37[32];
    stc_usbfs_diepmsk_bit_t                  DIEPMSK_b;
    stc_usbfs_doepmsk_bit_t                  DOEPMSK_b;
    uint32_t                                 RESERVED38[1856];
    stc_usbfs_diepctl0_bit_t                 DIEPCTL0_b;
    uint32_t                                 RESERVED39[32];
    stc_usbfs_diepint_bit_t                  DIEPINT0_b;
    uint32_t                                 RESERVED40[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL1_b;
    uint32_t                                 RESERVED41[32];
    stc_usbfs_diepint_bit_t                  DIEPINT1_b;
    uint32_t                                 RESERVED42[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL2_b;
    uint32_t                                 RESERVED43[32];
    stc_usbfs_diepint_bit_t                  DIEPINT2_b;
    uint32_t                                 RESERVED44[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL3_b;
    uint32_t                                 RESERVED45[32];
    stc_usbfs_diepint_bit_t                  DIEPINT3_b;
    uint32_t                                 RESERVED46[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL4_b;
    uint32_t                                 RESERVED47[32];
    stc_usbfs_diepint_bit_t                  DIEPINT4_b;
    uint32_t                                 RESERVED48[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL5_b;
    uint32_t                                 RESERVED49[32];
    stc_usbfs_diepint_bit_t                  DIEPINT5_b;
    uint32_t                                 RESERVED50[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL6_b;
    uint32_t                                 RESERVED51[32];
    stc_usbfs_diepint_bit_t                  DIEPINT6_b;
    uint32_t                                 RESERVED52[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL7_b;
    uint32_t                                 RESERVED53[32];
    stc_usbfs_diepint_bit_t                  DIEPINT7_b;
    uint32_t                                 RESERVED54[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL8_b;
    uint32_t                                 RESERVED55[32];
    stc_usbfs_diepint_bit_t                  DIEPINT8_b;
    uint32_t                                 RESERVED56[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL9_b;
    uint32_t                                 RESERVED57[32];
    stc_usbfs_diepint_bit_t                  DIEPINT9_b;
    uint32_t                                 RESERVED58[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL10_b;
    uint32_t                                 RESERVED59[32];
    stc_usbfs_diepint_bit_t                  DIEPINT10_b;
    uint32_t                                 RESERVED60[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL11_b;
    uint32_t                                 RESERVED61[32];
    stc_usbfs_diepint_bit_t                  DIEPINT11_b;
    uint32_t                                 RESERVED62[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL12_b;
    uint32_t                                 RESERVED63[32];
    stc_usbfs_diepint_bit_t                  DIEPINT12_b;
    uint32_t                                 RESERVED64[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL13_b;
    uint32_t                                 RESERVED65[32];
    stc_usbfs_diepint_bit_t                  DIEPINT13_b;
    uint32_t                                 RESERVED66[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL14_b;
    uint32_t                                 RESERVED67[32];
    stc_usbfs_diepint_bit_t                  DIEPINT14_b;
    uint32_t                                 RESERVED68[160];
    stc_usbfs_diepctl_bit_t                  DIEPCTL15_b;
    uint32_t                                 RESERVED69[32];
    stc_usbfs_diepint_bit_t                  DIEPINT15_b;
    uint32_t                                 RESERVED70[160];
    stc_usbfs_doepctl0_bit_t                 DOEPCTL0_b;
    uint32_t                                 RESERVED71[32];
    stc_usbfs_doepint_bit_t                  DOEPINT0_b;
    uint32_t                                 RESERVED72[32];
    stc_usbfs_doeptsiz0_bit_t                DOEPTSIZ0_b;
    uint32_t                                 RESERVED73[96];
    stc_usbfs_doepctl_bit_t                  DOEPCTL1_b;
    uint32_t                                 RESERVED74[32];
    stc_usbfs_doepint_bit_t                  DOEPINT1_b;
    uint32_t                                 RESERVED75[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL2_b;
    uint32_t                                 RESERVED76[32];
    stc_usbfs_doepint_bit_t                  DOEPINT2_b;
    uint32_t                                 RESERVED77[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL3_b;
    uint32_t                                 RESERVED78[32];
    stc_usbfs_doepint_bit_t                  DOEPINT3_b;
    uint32_t                                 RESERVED79[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL4_b;
    uint32_t                                 RESERVED80[32];
    stc_usbfs_doepint_bit_t                  DOEPINT4_b;
    uint32_t                                 RESERVED81[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL5_b;
    uint32_t                                 RESERVED82[32];
    stc_usbfs_doepint_bit_t                  DOEPINT5_b;
    uint32_t                                 RESERVED83[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL6_b;
    uint32_t                                 RESERVED84[32];
    stc_usbfs_doepint_bit_t                  DOEPINT6_b;
    uint32_t                                 RESERVED85[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL7_b;
    uint32_t                                 RESERVED86[32];
    stc_usbfs_doepint_bit_t                  DOEPINT7_b;
    uint32_t                                 RESERVED87[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL8_b;
    uint32_t                                 RESERVED88[32];
    stc_usbfs_doepint_bit_t                  DOEPINT8_b;
    uint32_t                                 RESERVED89[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL9_b;
    uint32_t                                 RESERVED90[32];
    stc_usbfs_doepint_bit_t                  DOEPINT9_b;
    uint32_t                                 RESERVED91[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL10_b;
    uint32_t                                 RESERVED92[32];
    stc_usbfs_doepint_bit_t                  DOEPINT10_b;
    uint32_t                                 RESERVED93[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL11_b;
    uint32_t                                 RESERVED94[32];
    stc_usbfs_doepint_bit_t                  DOEPINT11_b;
    uint32_t                                 RESERVED95[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL12_b;
    uint32_t                                 RESERVED96[32];
    stc_usbfs_doepint_bit_t                  DOEPINT12_b;
    uint32_t                                 RESERVED97[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL13_b;
    uint32_t                                 RESERVED98[32];
    stc_usbfs_doepint_bit_t                  DOEPINT13_b;
    uint32_t                                 RESERVED99[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL14_b;
    uint32_t                                 RESERVED100[32];
    stc_usbfs_doepint_bit_t                  DOEPINT14_b;
    uint32_t                                 RESERVED101[160];
    stc_usbfs_doepctl_bit_t                  DOEPCTL15_b;
    uint32_t                                 RESERVED102[32];
    stc_usbfs_doepint_bit_t                  DOEPINT15_b;
    uint32_t                                 RESERVED103[2208];
    stc_usbfs_gcctl_bit_t                    GCCTL_b;
} bCM_USBFS_TypeDef;

